0.orig/U.gas
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1.9638 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.9638 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (1.9638 0 0);
    }
    unheated_wall
    {
        type            slip;
    }
    heated_wall
    {
        type            slip;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}
