0.orig/alphat.liquid
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    unheated_wall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    heated_wall
    {
        type            compressible::alphatWallBoilingWallFunction;
        phaseType       liquid;
		otherPhase      gas;
        Prt             0.85;
        relax           0.01;
        value           uniform 0;

        partitioningModel
        {
            type        phaseFraction;
        }

        // DEBORA 1 Tuned sub-models (Table 6)
        nucleationSiteModel
        {
            type        LemmertChawla;
            Cn          1.60;
            Nref        25e6;
            deltaTref   10;
        }

        departureDiamModel
        {
            type        TolubinskiKostanchuk;
            dRef        0.00048; 
            deltaTref   45;
        }

        departureFreqModel
        {
            type        Cole;
        }
        value           uniform 0.01;

    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}
