0.orig/k.liquid
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.014;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.014;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.014;
        value           uniform 0.014;
    }
    unheated_wall
    {
        type            kqRWallFunction;
        value           uniform 0.014;
    }
    heated_wall
    {
        type            kqRWallFunction;
        value           uniform 0.014;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}
