0.orig/nut.gas
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    unheated_wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    heated_wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}
