constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            thermalPhaseChangeTwoPhaseSystem;

phases          (gas liquid);

phaseChange on;

gas
{
    type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d                0.0003; 
    }
    Sc              0.7;

    residualAlpha   1e-4;
}

liquid
{
    type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               0.0006; 
    }
    Sc              0.7;

    residualAlpha   1e-4;
}

blending
{
    default
    {
        type            none;
        continuousPhase liquid;
    }
}

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.00176; 
    }

    (liquid and gas)
    {
        type            constant;
        sigma           0.00176; 
    }
);

saturationModel
{
        type constant;

        Tsat 359.98;
        pSat 2.62e6;
};

aspectRatio
(

    (gas in liquid)
    {
        type            constant;
        E0              0.01777207997368;
    }

    (liquid in gas)
    {
        type            constant;
        E0               0.07108831989474; 
    }
);

drag
(
 	(gas in liquid)
    {
        type            IshiiZuber; 
        residualRe      1e-6;	        
		swarmCorrection
        {
            type        none;
        }
    }

    (liquid in gas)
    {
      	type            TomiyamaCorrelated; 
		A		16;        
		residualRe      1e-3;
		residualAlpha   1e-3;        
        swarmCorrection
        {
            type        none;
        }
    }

    (gas and liquid)
    {
        type            segregated;
        m               0.5;
        n               8;
        swarmCorrection
        {
            type        none;
        }
    }


);

virtualMass
(
    
    (gas in liquid)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    (liquid in gas)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer.gas
(
    (gas in liquid)
    {
	type            RanzMarshall;		
        residualAlpha   1e-3;        
    }

    (liquid in gas)
    {
	type            RanzMarshall; 
        residualAlpha   1e-3;        
    }

);

heatTransfer.liquid
(
    (gas in liquid)
    {
	type            RanzMarshall; 		
        residualAlpha   1e-3;        
    }

    (liquid in gas)
    {
	type            RanzMarshall;
        residualAlpha   1e-3;        
    }

);

phaseTransfer
();

lift
(
	(gas in liquid)
    {
     	type            Tomiyama; 
    }

  	(liquid in gas)
    {
     	type            Tomiyama; 
    }
);

wallLubrication
(
    (gas in liquid)
    {
        type            Antal; 
        Cw1             -0.01;
        Cw2             0.05;
    }
    (liquid in gas)
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }
);

turbulentDispersion
(
     (gas in liquid)
     {
        type                LopezDeBertodano; 
        sigma               0.7; 
        Ctd                 1.0; 
        residualAlpha       1e-4 ; 
    }

	(liquid in gas)
    {
     	type                LopezDeBertodano; 
        sigma               0.9;
        Ctd                 1.0;
        residualAlpha       1e-4;
    
    }

);

// Minimum allowable pressure
pMin            10000;
