system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0 0.0 0.0)                         			// 0
    (0.0 0.0095985378735 -0.000167543101798)        // 1
    (0.0 0.0095985378735 0.000167543101798)         // 2
    (1.0 0.0 0.0)                         			// 3
    (1.0 0.0095985378735 -0.000167543101798)        // 4
    (1.0 0.0095985378735 0.000167543101798)         // 5
	(4.5 0.0 0.0)                         			// 6
    (4.5 0.0095985378735 -0.000167543101798)        // 7
    (4.5 0.0095985378735 0.000167543101798)         // 8
	(5.0 0.0 0.0)                         			// 9
    (5.0 0.0095985378735 -0.000167543101798)        // 10
    (5.0 0.0095985378735 0.000167543101798)         // 11
);

blocks
(
    hex (0 1 2 0 3 4 5 3) (40 1 140) simpleGrading (1 1 1)
	hex (3 4 5 3 6 7 8 6) (40 1 490) simpleGrading (1 1 1)
	hex (6 7 8 6 9 10 11 9) (40 1 70) simpleGrading (1 1 1)
);

edges
(
    // Arcs for the outer boundary
    arc 1 2 (0.0 0.0096 0.0)
    arc 4 5 (1.0 0.0096 0.0)
    arc 7 8 (4.5 0.0096 0.0)
    arc 10 11 (5.0 0.0096 0.0)
);

boundary
(
    inlet
    {
        type patch;
        faces (
		(0 1 2 0)
		);
    }
    outlet
    {
        type patch;
        faces (
		(9 10 11 9)
		);
    }
    unheated_wall
    {
        type wall;
        faces (
		(1 4 5 2)
		(7 10 11 8)
		);
    }
	heated_wall
    {
        type wall;
        faces (
		(4 7 8 5)
		);
    }
    axis
    {
        type empty;
        faces (
		(0 3 3 0)
		(3 6 6 3)
		(6 9 9 6)
		); 
    }
    front
    {
        type wedge;
        faces (
		(0 2 5 3)
		(3 5 8 6)
		(6 8 11 9)
		);
    }
    back
    {
        type wedge;
        faces (
		(0 3 4 1)
		(3 6 7 4)
		(6 9 10 7)
		);
    }
);

mergePatchPairs
();

// ************************************************************************* //
